---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.UpdaterId
source: html/84aaa89c-949f-1a09-4071-03c617d901b8.htm
---
# UpdaterId Members

creates an instance of UpdaterId for given AddInId and a given GUID value